; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v5 ?v12)
             (pred_1 ?v7 ?v3)
             (pred_12 ?v5 ?v3)
             (pred_6 ?v10 ?v5 )
	     (pred_8 ?v5)
             (pred_3 ?v6)
             (pred_9 ?v7)
             (pred_5 ?v3)
             (pred_7 ?v5)
             (pred_4 ?v7)
             (pred_10 ?v5)
             (pred_2 ))



(:action op_3
:parameters (?v1 ?v4 ?v8 ?v13)
:precondition (and (pred_3 ?v1) (pred_3 ?v4) (pred_9 ?v8) (pred_5 ?v13)
          (pred_11 ?v1 ?v4) (pred_1 ?v8 ?v13)
                   (pred_12 ?v4 ?v13) (pred_8 ?v1) 
                   (pred_7 ?v4) (pred_4 ?v8))
:effect (and  (pred_10 ?v4) (not (pred_7 ?v4))))


(:action op_5
:parameters (?v1 ?v9)
:precondition (and (pred_3 ?v1) (pred_3 ?v9)
               (pred_8 ?v1) (pred_11 ?v1 ?v9) (pred_10 ?v9))
:effect (and (pred_8 ?v9) (not (pred_8 ?v1))))

(:action op_2
:parameters (?v1 ?v8)
:precondition (and (pred_3 ?v1) (pred_9 ?v8) 
                  (pred_8 ?v1) (pred_6 ?v8 ?v1) (pred_2 ))
:effect (and (pred_4 ?v8)
   (not (pred_6 ?v8 ?v1)) (not (pred_2 ))))


(:action op_4
:parameters (?v1 ?v2 ?v11)
:precondition (and (pred_3 ?v1) (pred_9 ?v2) (pred_9 ?v11)
                  (pred_8 ?v1) (pred_4 ?v11) (pred_6 ?v2 ?v1))
:effect (and (pred_4 ?v2) (pred_6 ?v11 ?v1)
        (not (pred_4 ?v11)) (not (pred_6 ?v2 ?v1))))

(:action op_1
:parameters (?v1 ?v8)
:precondition (and (pred_3 ?v1) (pred_9 ?v8) 
                  (pred_8 ?v1) (pred_4 ?v8))
:effect (and (pred_2 ) (pred_6 ?v8 ?v1) (not (pred_4 ?v8)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_02 obj_11 obj_01 obj_20 obj_03 obj_17 obj_16 obj_05 obj_06 obj_07 obj_08 obj_14 obj_09 obj_19 obj_15 obj_13
    obj_18 obj_10
    obj_12 obj_04
    )

    (:init
       (pred_2)

       (pred_3 obj_02)
       (pred_3 obj_11)
       (pred_3 obj_01)
       (pred_3 obj_20)
       (pred_3 obj_03)
       (pred_3 obj_17)
       (pred_3 obj_16)
       (pred_3 obj_05)
       (pred_3 obj_06)
       (pred_3 obj_07)
       (pred_3 obj_08)
       (pred_3 obj_14)
       (pred_3 obj_09)
       (pred_3 obj_19)
       (pred_3 obj_15)
       (pred_3 obj_13)
       (pred_5 obj_18)
       (pred_5 obj_10)
       (pred_9 obj_12)
       (pred_9 obj_04)

       (pred_11 obj_02 obj_03)
       (pred_11 obj_02 obj_11)
       (pred_11 obj_11 obj_17)
       (pred_11 obj_11 obj_01)
       (pred_11 obj_11 obj_02)
       (pred_11 obj_01 obj_16)
       (pred_11 obj_01 obj_20)
       (pred_11 obj_01 obj_11)
       (pred_11 obj_20 obj_05)
       (pred_11 obj_20 obj_01)
       (pred_11 obj_03 obj_06)
       (pred_11 obj_03 obj_17)
       (pred_11 obj_03 obj_02)
       (pred_11 obj_17 obj_07)
       (pred_11 obj_17 obj_16)
       (pred_11 obj_17 obj_11)
       (pred_11 obj_17 obj_03)
       (pred_11 obj_16 obj_08)
       (pred_11 obj_16 obj_05)
       (pred_11 obj_16 obj_01)
       (pred_11 obj_16 obj_17)
       (pred_11 obj_05 obj_14)
       (pred_11 obj_05 obj_20)
       (pred_11 obj_05 obj_16)
       (pred_11 obj_06 obj_09)
       (pred_11 obj_06 obj_07)
       (pred_11 obj_06 obj_03)
       (pred_11 obj_07 obj_19)
       (pred_11 obj_07 obj_08)
       (pred_11 obj_07 obj_17)
       (pred_11 obj_07 obj_06)
       (pred_11 obj_08 obj_15)
       (pred_11 obj_08 obj_14)
       (pred_11 obj_08 obj_16)
       (pred_11 obj_08 obj_07)
       (pred_11 obj_14 obj_13)
       (pred_11 obj_14 obj_05)
       (pred_11 obj_14 obj_08)
       (pred_11 obj_09 obj_19)
       (pred_11 obj_09 obj_06)
       (pred_11 obj_19 obj_15)
       (pred_11 obj_19 obj_07)
       (pred_11 obj_19 obj_09)
       (pred_11 obj_15 obj_13)
       (pred_11 obj_15 obj_08)
       (pred_11 obj_15 obj_19)
       (pred_11 obj_13 obj_14)
       (pred_11 obj_13 obj_15)
       (pred_7 obj_02)
       (pred_7 obj_09)
       (pred_12  obj_02 obj_18)
       (pred_12  obj_09 obj_10)
       (pred_10 obj_11)
       (pred_10 obj_01)
       (pred_10 obj_20)
       (pred_10 obj_03)
       (pred_10 obj_17)
       (pred_10 obj_16)
       (pred_10 obj_05)
       (pred_10 obj_06)
       (pred_10 obj_07)
       (pred_10 obj_08)
       (pred_10 obj_14)
       (pred_10 obj_19)
       (pred_10 obj_15)
       (pred_10 obj_13)

       (pred_1  obj_12 obj_18)
       (pred_1  obj_04 obj_10)
       (pred_6 obj_12 obj_05)
       (pred_6 obj_04 obj_01)
       (pred_8 obj_20)
    )

    (:goal (and
       (pred_6 obj_12 obj_08)
    ))
(:constraints
  (always (not (pred_8 obj_16)))
)
)

; plan
1. (op_5 obj_20 obj_05)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_05)
   goals met: 0 of 1
2. (op_2 obj_05 obj_12)
   deleted: (pred_6 obj_12 obj_05) (pred_2)
   added: (pred_4 obj_12)
   goals met: 0 of 1
3. (op_5 obj_05 obj_14)
   deleted: (pred_8 obj_05)
   added: (pred_8 obj_14)
   goals met: 0 of 1
4. (op_5 obj_14 obj_08)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_08)
   goals met: 0 of 1
5. (op_1 obj_08 obj_12)
   deleted: (pred_4 obj_12)
   added: (pred_2) (pred_6 obj_12 obj_08)
   goals met: 1 of 1
